Cleaning Data for visualizations

In [17]:
#Importing libraries
import pandas as pd
import matplotlib.pyplot as plt

In [18]:
#importing stock data 

stock_data_df = pd.read_excel('Random 20 S&P500 Stock Data.xlsx')
stock_data_df.head(10)

,Date,Symbol,Adj Close,Close,High,Low,Open,Volume
0,2022-12-30,ADBE,336.529999,336.529999,336.640015,331.640015,333.000000,1740300.0
1,2022-12-30,MO,45.709999,45.709999,45.990002,45.419998,45.860001,5025200.0
2,2022-12-30,AMZN,84.000000,84.000000,84.050003,82.470001,83.120003,62330000.0
3,2022-12-30,AMD,64.769997,64.769997,64.820000,63.139999,63.770000,37099800.0
4,2022-12-30,AAL,12.720000,12.720000,12.830000,12.530000,12.550000,18976200.0
5,2022-12-30,AAPL,129.929993,129.929993,129.949997,127.430000,128.410004,76960600.0
6,2022-12-30,T,18.410000,18.410000,18.480000,18.219999,18.420000,26200800.0
7,2022-12-30,BLK,708.630005,708.630005,712.909973,698.359985,708.289978,413000.0
8,2022-12-30,EA,122.180000,122.180000,122.330002,120.790001,121.779999,1164400.0
9,2022-12-30,EQIX,655.030029,655.030029,665.349976,648.229981,659.359985,268500.0

In [19]:
#importing company data
company_data_df = pd.read_csv("sp500_companies.csv")
company_data_df.head()

  Exchange Symbol              Shortname                  Sector
0      NMS   AAPL             Apple Inc.              Technology
1      NMS   MSFT  Microsoft Corporation              Technology
2      NMS   GOOG          Alphabet Inc.  Communication Services
3      NMS  GOOGL          Alphabet Inc.  Communication Services
4      NMS   AMZN       Amazon.com, Inc.       Consumer Cyclical

In [20]:
# To Do:
# check column
# check for NAN values
# check data types for columns 
# in stock data df 
# drop adjusted close
# timeline of volume performance
# in company data cut down to 20 stocks check sector and industries to see how many times represented
#in company data drop ebitda,marketcap,Marketcap,Ebitda	Revenuegrowth,City,State,Country,Fulltimeemployees,Longbusinesssummary,Weigh

In [21]:
#stock data clean up
stock_data_df.head()

,Date,Symbol,Adj Close,Close,High,Low,Open,Volume
0,2022-12-30,ADBE,336.529999,336.529999,336.640015,331.640015,333.000000,1740300.0
1,2022-12-30,MO,45.709999,45.709999,45.990002,45.419998,45.860001,5025200.0
2,2022-12-30,AMZN,84.000000,84.000000,84.050003,82.470001,83.120003,62330000.0
3,2022-12-30,AMD,64.769997,64.769997,64.820000,63.139999,63.770000,37099800.0
4,2022-12-30,AAL,12.720000,12.720000,12.830000,12.530000,12.550000,18976200.0

In [22]:
#checking data types
stock_data_df.dtypes

Date         datetime64[ns]
Symbol               object
Adj Close           float64
Close               float64
High                float64
Low                 float64
Open                float64
Volume              float64
dtype: object

In [23]:
#checking for nan values
stock_data_df.isnull().sum()

Date           0
Symbol         0
Adj Close    825
Close        825
High         825
Low          825
Open         825
Volume       825
dtype: int64

In [24]:
#Null values confirmed as spacing. Dropping null values
stock_data_df.dropna(inplace=True)

In [25]:
stock_data_df.isnull().sum()

Date         0
Symbol       0
Adj Close    0
Close        0
High         0
Low          0
Open         0
Volume       0
dtype: int64

In [26]:
#checking symbol unique values
stock_data_df["Symbol"].unique()

array(['ADBE', 'MO', 'AMZN', 'AMD', 'AAL', 'AAPL', 'T', 'BLK', 'EA',
       'EQIX', 'ETSY', 'F', 'GD', 'GPN', 'GS', 'HCA', 'HSY', 'IBM', 'JPM',
       'MU'], dtype=object)

In [27]:
#dropping Adj Close column
stock_data_df = stock_data_df.drop("Adj Close",axis=1)

In [29]:
# Converting the Date column to datetime method
stock_data_df['Date'] = pd.to_datetime(stock_data_df['Date'])
stock_data_df.dtypes

Date      datetime64[ns]
Symbol            object
Close            float64
High             float64
Low              float64
Open             float64
Volume           float64
dtype: object

In [30]:
stock_data_df.head()

,Date,Symbol,Close,High,Low,Open,Volume
0,2022-12-30,ADBE,336.529999,336.640015,331.640015,333.000000,1740300.0
1,2022-12-30,MO,45.709999,45.990002,45.419998,45.860001,5025200.0
2,2022-12-30,AMZN,84.000000,84.050003,82.470001,83.120003,62330000.0
3,2022-12-30,AMD,64.769997,64.820000,63.139999,63.770000,37099800.0
4,2022-12-30,AAL,12.720000,12.830000,12.530000,12.550000,18976200.0

In [31]:
#dropping company data colummns
company_data_df.head()

  Exchange Symbol              Shortname                  Sector
0      NMS   AAPL             Apple Inc.              Technology
1      NMS   MSFT  Microsoft Corporation              Technology
2      NMS   GOOG          Alphabet Inc.  Communication Services
3      NMS  GOOGL          Alphabet Inc.  Communication Services
4      NMS   AMZN       Amazon.com, Inc.       Consumer Cyclical

In [32]:
# changing the 'shortname' column to name
company_data_df = company_data_df.rename(columns={'Shortname':'Name'})
company_data_df.head()

  Exchange Symbol                   Name                  Sector
0      NMS   AAPL             Apple Inc.              Technology
1      NMS   MSFT  Microsoft Corporation              Technology
2      NMS   GOOG          Alphabet Inc.  Communication Services
3      NMS  GOOGL          Alphabet Inc.  Communication Services
4      NMS   AMZN       Amazon.com, Inc.       Consumer Cyclical

In [21]:
# company_data_df = company_data_df.drop(["Ebitda","Marketcap", "Revenuegrowth","City","State","Country","Fulltimeemployees","Longbusinesssummary","Weight"], axis=1)
# #checking dropped columns
# company_data_df.head(20)

In [23]:
# #dropping long name column and current price
# company_data_df = company_data_df.drop(["Longname","Currentprice"],axis=1)

In [33]:
#export to CSV
company_data_df.to_csv("companydf_clean.csv", index=False)
stock_data_df.to_csv("stockdf_clean.csv", index=False)